---
kind: enumMember
id: F:Autodesk.Revit.Creation.eRefFace.CenterX
enum: Autodesk.Revit.Creation.eRefFace
source: html/900d9088-2ea5-1953-3b01-0c9cc141825a.htm
---
# Autodesk.Revit.Creation.eRefFace.CenterX

The reference face is at the middle of the element in the direction
of x-axis and its normal is parallel to x-axis.